#### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  
  ```terraform
  Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jujulego/ants/runs/run-vPqQyedYaxaHfyL5

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
data.aws_iam_policy_document.ants-authorized: Reading...
data.aws_iam_policy_document.ants-authorized: Read complete after 0s [id=2279520873]
aws_cognito_user_pool.ants-user-pool: Refreshing state... [id=eu-west-3_A8Vxd3hvy]
aws_cognito_user_pool_domain.ants: Refreshing state... [id=ants-dev]
aws_cognito_user_pool_client.ants-frontend: Refreshing state... [id=67rjs7399rsdq6scc31nrvcdbm]
aws_ssm_parameter.ants-user-pool-id: Refreshing state... [id=/ants/dev/user-pool-id]
aws_cognito_identity_pool.ants-identity-pool: Refreshing state... [id=eu-west-3:8a72a0d0-f5e9-4576-a6dd-3acd010c37b3]
aws_ssm_parameter.ants-client-id: Refreshing state... [id=/ants/dev/client-id]
data.aws_iam_policy_document.ants-authorized-assume-role: Reading...
data.aws_iam_policy_document.ants-authorized-assume-role: Read complete after 0s [id=3156192928]
aws_iam_role.ants-authorized-user: Refreshing state... [id=ants-authorized-user-dev]
aws_cognito_identity_pool_roles_attachment.ants-identity-pool: Refreshing state... [id=eu-west-3:8a72a0d0-f5e9-4576-a6dd-3acd010c37b3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.ants-auth-domain will be created
  + resource "aws_ssm_parameter" "ants-auth-domain" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ants/dev/auth-domain"
      + tags_all       = {
          + "Project" = "ants"
          + "STAGE"   = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.ants-identity-pool-id will be created
  + resource "aws_ssm_parameter" "ants-identity-pool-id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ants/dev/identity-pool-id"
      + tags_all       = {
          + "Project" = "ants"
          + "STAGE"   = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


  ```
  
  </details>
  *Pushed by: @Jujulego, Action: `pull_request`*